hw2/hw2/src/main/java/client/bottom_up.FlightTicketReservationService

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://flight_reservation" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://flight_reservation" name="FlightTicketReservationServiceService">
<types>
<xsd:schema>
<xsd:import namespace="http://flight_reservation" schemaLocation="http://localhost:9000/bottom_up.FlightTicketReservationService?xsd=1"/>
</xsd:schema>
</types>
<message name="sayHelloWorldFrom">
<part name="parameters" element="tns:sayHelloWorldFrom"/>
</message>
<message name="sayHelloWorldFromResponse">
<part name="parameters" element="tns:sayHelloWorldFromResponse"/>
</message>
<message name="login">
<part name="parameters" element="tns:login"/>
</message>
<message name="loginResponse">
<part name="parameters" element="tns:loginResponse"/>
</message>
<message name="AuthorizationException">
<part name="fault" element="tns:AuthorizationException"/>
</message>
<portType name="FlightTicketReservationService">
<operation name="sayHelloWorldFrom">
<input wsam:Action="http://flight_reservation/FlightTicketReservationService/sayHelloWorldFromRequest" message="tns:sayHelloWorldFrom"/>
<output wsam:Action="http://flight_reservation/FlightTicketReservationService/sayHelloWorldFromResponse" message="tns:sayHelloWorldFromResponse"/>
</operation>
<operation name="login">
<input wsam:Action="http://flight_reservation/FlightTicketReservationService/loginRequest" message="tns:login"/>
<output wsam:Action="http://flight_reservation/FlightTicketReservationService/loginResponse" message="tns:loginResponse"/>
<fault message="tns:AuthorizationException" name="AuthorizationException" wsam:Action="http://flight_reservation/FlightTicketReservationService/login/Fault/AuthorizationException"/>
</operation>
</portType>
<binding name="FlightTicketReservationServicePortBinding" type="tns:FlightTicketReservationService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="sayHelloWorldFrom">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="login">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="AuthorizationException">
<soap:fault name="AuthorizationException" use="literal"/>
</fault>
</operation>
</binding>
<service name="FlightTicketReservationServiceService">
<port name="FlightTicketReservationServicePort" binding="tns:FlightTicketReservationServicePortBinding">
<soap:address location="http://localhost:9000/bottom_up.FlightTicketReservationService"/>
</port>
</service>
</definitions>