hw2/DeliverableDocuments/SOAP/top_down/login_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns3:login xmlns:ns2="http://id2208.se.kth.top_down.FlightTicketReservationServiceTopDown"
                   xmlns:ns3="http://flight_reservation">
            <arg0>kim</arg0>
            <arg1>id2208</arg1>
        </ns3:login>
    </S:Body>
</S:Envelope>